lozaning/The_WiFivedra/firmware/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32c5"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Console: disable completely — USB CDC carries binary SLIP data
CONFIG_ESP_CONSOLE_NONE=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
CONFIG_LOG_DEFAULT_LEVEL_NONE=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# WiFi — skip NVS calibration storage
CONFIG_ESP_WIFI_NVS_ENABLED=n
